SS-Electronics/FreeRTOS-OS/arch/devices/STM/STM32H7xx/STM32H723/stm32_h723xx.h
/**
 ******************************************************************************
 * @file    stm32_h723xx.h
 * @author  Subhajit Roy  subhajitroy005@gmail.com
 * @brief   CMSIS STM32H723xx Device Peripheral Access Layer Header.
 *
 *          Contains:
 *            - Cortex-M7 core configuration macros
 *            - IRQn_Type enum (RM0468 Table 122 — position column)
 *            - Peripheral register TypeDefs
 *            - Peripheral base addresses and instance pointer macros
 *
 *          Reference: STM32H723/733/725/735/730 Reference Manual RM0468 Rev 4.
 *
 *          Peripheral register structures list only the fields used by the
 *          OS HAL layer.  For the full bit-field expansion use ST's official
 *          CMSIS pack (STM32CubeH7 v1.11+).
 *
 * This file is part of FreeRTOS-OS Project.
 * FreeRTOS-OS is free software; see <https://www.gnu.org/licenses/>.
 ******************************************************************************
 */

#ifndef __STM32_H723XX_H
#define __STM32_H723XX_H

#ifdef __cplusplus
extern "C" {
#endif

/* ── 1. Cortex-M7 Core Configuration ─────────────────────────────────────── */
/* STM32H723 uses Cortex-M7 r1p1.  FreeRTOS ARM_CM7/r0p1 port targets all
 * CM7 silicon — including r1p1.  The r0p1 name reflects the errata the port
 * works around, not a silicon revision requirement.                          */
#define __CM7_REV                 0x0101U  /*!< Core revision r1p1           */
#define __MPU_PRESENT             1U       /*!< MPU present                  */
#define __NVIC_PRIO_BITS          4U       /*!< 4-bit priority (16 levels)   */
#define __Vendor_SysTickConfig    0U       /*!< Use the standard SysTick     */
#define __FPU_PRESENT             1U       /*!< Cortex-M7 DP-FPU             */
#define __DCACHE_PRESENT          1U       /*!< D-Cache present              */
#define __ICACHE_PRESENT          1U       /*!< I-Cache present              */
#define __DTCM_PRESENT            1U       /*!< DTCM present                 */

/* ── 2. Interrupt Number Definitions ─────────────────────────────────────── */
/* RM0468 Table 122: STM32H723/733 vector table.                              */
typedef enum
{
    /* ── Cortex-M7 core exceptions (negative numbers) ─────────────────────── */
    NonMaskableInt_IRQn     = -14,
    HardFault_IRQn          = -13,
    MemoryManagement_IRQn   = -12,
    BusFault_IRQn           = -11,
    UsageFault_IRQn         = -10,
    SVCall_IRQn             = -5,
    DebugMonitor_IRQn       = -4,
    PendSV_IRQn             = -2,
    SysTick_IRQn            = -1,

    /* ── STM32H723 peripheral interrupts (RM0468 §23.3 Table 122) ─────────── */
    WWDG_IRQn                        = 0,
    PVD_AVD_IRQn                     = 1,
    TAMP_STAMP_RTC_WKUP_LSECSS_IRQn = 2,
    RTC_WKUP_IRQn                    = 3,
    FLASH_IRQn                       = 4,
    RCC_IRQn                         = 5,
    EXTI0_IRQn                       = 6,
    EXTI1_IRQn                       = 7,
    EXTI2_IRQn                       = 8,
    EXTI3_IRQn                       = 9,
    EXTI4_IRQn                       = 10,
    DMA1_Stream0_IRQn                = 11,
    DMA1_Stream1_IRQn                = 12,
    DMA1_Stream2_IRQn                = 13,
    DMA1_Stream3_IRQn                = 14,
    DMA1_Stream4_IRQn                = 15,
    DMA1_Stream5_IRQn                = 16,
    DMA1_Stream6_IRQn                = 17,
    ADC_IRQn                         = 18,
    FDCAN1_IT0_IRQn                  = 19,
    FDCAN2_IT0_IRQn                  = 20,
    FDCAN1_IT1_IRQn                  = 21,
    FDCAN2_IT1_IRQn                  = 22,
    EXTI9_5_IRQn                     = 23,
    TIM1_BRK_IRQn                    = 24,
    TIM1_UP_IRQn                     = 25,
    TIM1_TRG_COM_IRQn                = 26,
    TIM1_CC_IRQn                     = 27,
    TIM2_IRQn                        = 28,
    TIM3_IRQn                        = 29,
    TIM4_IRQn                        = 30,
    I2C1_EV_IRQn                     = 31,
    I2C1_ER_IRQn                     = 32,
    I2C2_EV_IRQn                     = 33,
    I2C2_ER_IRQn                     = 34,
    SPI1_IRQn                        = 35,
    SPI2_IRQn                        = 36,
    USART1_IRQn                      = 37,
    USART2_IRQn                      = 38,
    USART3_IRQn                      = 39,
    EXTI15_10_IRQn                   = 40,
    RTC_Alarm_IRQn                   = 41,
    TIM8_BRK_TIM12_IRQn             = 43,
    TIM8_UP_TIM13_IRQn              = 44,
    TIM8_TRG_COM_TIM14_IRQn        = 45,
    TIM8_CC_IRQn                    = 46,
    DMA1_Stream7_IRQn               = 47,
    FMC_IRQn                        = 48,
    SDMMC1_IRQn                     = 49,
    TIM5_IRQn                       = 50,
    SPI3_IRQn                       = 51,
    UART4_IRQn                      = 52,
    UART5_IRQn                      = 53,
    TIM6_DAC_IRQn                   = 54,
    TIM7_IRQn                       = 55,
    DMA2_Stream0_IRQn               = 56,
    DMA2_Stream1_IRQn               = 57,
    DMA2_Stream2_IRQn               = 58,
    DMA2_Stream3_IRQn               = 59,
    DMA2_Stream4_IRQn               = 60,
    ETH_IRQn                        = 61,
    ETH_WKUP_IRQn                   = 62,
    FDCAN_CAL_IRQn                  = 63,
    DMA2_Stream5_IRQn               = 68,
    DMA2_Stream6_IRQn               = 69,
    DMA2_Stream7_IRQn               = 70,
    USART6_IRQn                     = 71,
    I2C3_EV_IRQn                    = 72,
    I2C3_ER_IRQn                    = 73,
    OTG_HS_EP1_OUT_IRQn             = 74,
    OTG_HS_EP1_IN_IRQn              = 75,
    OTG_HS_WKUP_IRQn               = 76,
    OTG_HS_IRQn                     = 77,
    DCMI_PSSI_IRQn                  = 78,
    CRYP_IRQn                       = 79,
    HASH_RNG_IRQn                   = 80,
    FPU_IRQn                        = 81,
    UART7_IRQn                      = 82,
    UART8_IRQn                      = 83,
    SPI4_IRQn                       = 84,
    SPI5_IRQn                       = 85,
    SPI6_IRQn                       = 86,
    SAI1_IRQn                       = 87,
    LTDC_IRQn                       = 88,
    LTDC_ER_IRQn                    = 89,
    DMA2D_IRQn                      = 90,
    OCTOSPI1_IRQn                   = 92,
    LPTIM1_IRQn                     = 93,
    CEC_IRQn                        = 94,
    I2C4_EV_IRQn                    = 95,
    I2C4_ER_IRQn                    = 96,
    SPDIF_RX_IRQn                   = 97,
    OTG_FS_EP1_OUT_IRQn             = 98,
    OTG_FS_EP1_IN_IRQn              = 99,
    OTG_FS_WKUP_IRQn               = 100,
    OTG_FS_IRQn                     = 101,
    DMAMUX1_OVR_IRQn               = 102,
    HRTIM1_Master_IRQn             = 103,
    HRTIM1_TIMA_IRQn               = 104,
    HRTIM1_TIMB_IRQn               = 105,
    HRTIM1_TIMC_IRQn               = 106,
    HRTIM1_TIMD_IRQn               = 107,
    HRTIM1_TIME_IRQn               = 108,
    HRTIM1_FLT_IRQn                = 109,
    DFSDM1_FLT0_IRQn               = 110,
    DFSDM1_FLT1_IRQn               = 111,
    DFSDM1_FLT2_IRQn               = 112,
    DFSDM1_FLT3_IRQn               = 113,
    SAI3_IRQn                       = 114,
    SWPMI1_IRQn                     = 115,
    TIM15_IRQn                      = 116,
    TIM16_IRQn                      = 117,
    TIM17_IRQn                      = 118,
    MDIOS_WKUP_IRQn                = 119,
    MDIOS_IRQn                      = 120,
    JPEG_IRQn                       = 121,
    MDMA_IRQn                       = 122,
    SDMMC2_IRQn                     = 124,
    HSEM1_IRQn                      = 125,
    ADC3_IRQn                       = 127,
    DMAMUX2_OVR_IRQn               = 128,
    BDMA_Channel0_IRQn             = 129,
    BDMA_Channel1_IRQn             = 130,
    BDMA_Channel2_IRQn             = 131,
    BDMA_Channel3_IRQn             = 132,
    BDMA_Channel4_IRQn             = 133,
    BDMA_Channel5_IRQn             = 134,
    BDMA_Channel6_IRQn             = 135,
    BDMA_Channel7_IRQn             = 136,
    COMP1_IRQn                      = 137,
    LPTIM2_IRQn                     = 138,
    LPTIM3_IRQn                     = 139,
    LPTIM4_IRQn                     = 140,
    LPTIM5_IRQn                     = 141,
    LPUART1_IRQn                    = 142,
    CRS_IRQn                        = 144,
    ECC_IRQn                        = 145,
    SAI4_IRQn                       = 146,
    HOLD_CORE_IRQn                  = 148,
    WAKEUP_PIN_IRQn                 = 149,
    CORDIC_IRQn                     = 150,
    FMAC_IRQn                       = 151,
} IRQn_Type;

