SS-Electronics/FreeRTOS-OS/arch/devices/STM/STM32H7xx/STM32H723/stm32_h723xx.h
/* CMSIS core — IRQn_Type must be defined before this include */
#include "CMSIS/Core/Include/core_cm7.h"  /* resolved via -I arch/arm/CMSIS_6 */

/* ── 3. Peripheral Register TypeDefs ─────────────────────────────────────── */
/* Only fields directly accessed by FreeRTOS-OS HAL drivers are listed.
 * Reserved padding keeps offsets correct per RM0468 register maps.          */

typedef struct
{
    __IO uint32_t MODER;    /*!< 0x00 Mode register               */
    __IO uint32_t OTYPER;   /*!< 0x04 Output type register        */
    __IO uint32_t OSPEEDR;  /*!< 0x08 Output speed register       */
    __IO uint32_t PUPDR;    /*!< 0x0C Pull-up/pull-down register  */
    __IO uint32_t IDR;      /*!< 0x10 Input data register         */
    __IO uint32_t ODR;      /*!< 0x14 Output data register        */
    __IO uint32_t BSRR;     /*!< 0x18 Bit set/reset register      */
    __IO uint32_t LCKR;     /*!< 0x1C Configuration lock register */
    __IO uint32_t AFR[2];   /*!< 0x20 Alternate function [0]=low [1]=high */
} GPIO_TypeDef;

typedef struct
{
    __IO uint32_t CR1;      /*!< 0x00 Control register 1  */
    __IO uint32_t CR2;      /*!< 0x04 Control register 2  */
    __IO uint32_t CR3;      /*!< 0x08 Control register 3  */
    __IO uint32_t BRR;      /*!< 0x0C Baud rate register  */
    __IO uint32_t GTPR;     /*!< 0x10 Guard time / prescaler */
    __IO uint32_t RTOR;     /*!< 0x14 Receiver timeout    */
    __IO uint32_t RQR;      /*!< 0x18 Request register    */
    __IO uint32_t ISR;      /*!< 0x1C Interrupt & status  */
    __IO uint32_t ICR;      /*!< 0x20 Interrupt clear register */
    __IO uint32_t RDR;      /*!< 0x24 Receive data register   */
    __IO uint32_t TDR;      /*!< 0x28 Transmit data register  */
    __IO uint32_t PRESC;    /*!< 0x2C Prescaler register      */
} USART_TypeDef;

/* H7 UART is register-compatible with USART */
#define UART_TypeDef  USART_TypeDef

typedef struct
{
    __IO uint32_t CR1;      /*!< 0x00 Control register 1   */
    __IO uint32_t CR2;      /*!< 0x04 Control register 2   */
    __IO uint32_t OAR1;     /*!< 0x08 Own address 1        */
    __IO uint32_t OAR2;     /*!< 0x0C Own address 2        */
    __IO uint32_t TIMINGR;  /*!< 0x10 Timing register      */
    __IO uint32_t TIMEOUTR; /*!< 0x14 Timeout register     */
    __IO uint32_t ISR;      /*!< 0x18 Interrupt & status   */
    __IO uint32_t ICR;      /*!< 0x1C Interrupt clear      */
    __IO uint32_t PECR;     /*!< 0x20 PEC register         */
    __IO uint32_t RXDR;     /*!< 0x24 Receive data         */
    __IO uint32_t TXDR;     /*!< 0x28 Transmit data        */
} I2C_TypeDef;

typedef struct
{
    __IO uint32_t CR1;      /*!< 0x00 Control register 1  */
    __IO uint32_t CR2;      /*!< 0x04 Control register 2  */
    __IO uint32_t SR;       /*!< 0x08 Status register     */
    __IO uint32_t IFCR;     /*!< 0x0C Interrupt/status clear */
    __IO uint32_t AUTOCR;   /*!< 0x10 Autonomous mode control */
    __IO uint32_t CFG1;     /*!< 0x14 Configuration register 1 */
    __IO uint32_t CFG2;     /*!< 0x18 Configuration register 2 */
    __IO uint32_t IER;      /*!< 0x1C Interrupt enable    */
    __IO uint32_t UDRDR;    /*!< 0x20 Underrun data register */
    __IO uint32_t RXDR;     /*!< 0x24 RX data register (only on SPI3) */
    __IO uint32_t TXDR;     /*!< 0x28 TX data register    */
} SPI_TypeDef;

/* RCC — only fields used by clock init (SystemInit / hal_rcc_stm32.c) */
typedef struct
{
    __IO uint32_t CR;               /*!< 0x000 Clock control register                */
    __IO uint32_t HSICFGR;         /*!< 0x004 HSI calibration                       */
    __IO uint32_t CRRCR;           /*!< 0x008 CSI calibration / RC48 calibration    */
    __IO uint32_t CSICFGR;         /*!< 0x00C CSI calibration                       */
    __IO uint32_t CFGR;            /*!< 0x010 Clock configuration                   */
         uint32_t RESERVED0;       /*!< 0x014                                        */
    __IO uint32_t D1CFGR;          /*!< 0x018 D1 domain clock configuration         */
    __IO uint32_t D2CFGR;          /*!< 0x01C D2 domain clock configuration         */
    __IO uint32_t D3CFGR;          /*!< 0x020 D3 domain clock configuration         */
         uint32_t RESERVED1;       /*!< 0x024                                        */
    __IO uint32_t PLLCKSELR;       /*!< 0x028 PLLs clock source                     */
    __IO uint32_t PLLCFGR;         /*!< 0x02C PLLs configuration                    */
    __IO uint32_t PLL1DIVR;        /*!< 0x030 PLL1 dividers                         */
    __IO uint32_t PLL1FRACR;       /*!< 0x034 PLL1 fractional divider               */
    __IO uint32_t PLL2DIVR;        /*!< 0x038 PLL2 dividers                         */
    __IO uint32_t PLL2FRACR;       /*!< 0x03C PLL2 fractional divider               */
    __IO uint32_t PLL3DIVR;        /*!< 0x040 PLL3 dividers                         */
    __IO uint32_t PLL3FRACR;       /*!< 0x044 PLL3 fractional divider               */
         uint32_t RESERVED2;       /*!< 0x048                                        */
    __IO uint32_t D1CCIPR;         /*!< 0x04C D1 kernel clock prescalers            */
    __IO uint32_t D2CCIP1R;        /*!< 0x050 D2 kernel clock prescalers 1          */
    __IO uint32_t D2CCIP2R;        /*!< 0x054 D2 kernel clock prescalers 2          */
    __IO uint32_t D3CCIPR;         /*!< 0x058 D3 kernel clock prescalers            */
         uint32_t RESERVED3;       /*!< 0x05C                                        */
    __IO uint32_t CIER;            /*!< 0x060 Clock interrupt enable                */
    __IO uint32_t CIFR;            /*!< 0x064 Clock interrupt flag                  */
    __IO uint32_t CICR;            /*!< 0x068 Clock interrupt clear                 */
         uint32_t RESERVED4;       /*!< 0x06C                                        */
    __IO uint32_t BDCR;            /*!< 0x070 Backup domain control                 */
    __IO uint32_t CSR;             /*!< 0x074 Clock control & status                */
         uint32_t RESERVED5[2];    /*!< 0x078-0x07C                                 */
    __IO uint32_t AHB3RSTR;        /*!< 0x07C AHB3 peripheral reset                 */
    __IO uint32_t AHB1RSTR;        /*!< 0x080 AHB1 peripheral reset                 */
    __IO uint32_t AHB2RSTR;        /*!< 0x084 AHB2 peripheral reset                 */
    __IO uint32_t AHB4RSTR;        /*!< 0x088 AHB4 peripheral reset                 */
    __IO uint32_t APB3RSTR;        /*!< 0x08C APB3 peripheral reset                 */
    __IO uint32_t APB1LRSTR;       /*!< 0x090 APB1L peripheral reset                */
    __IO uint32_t APB1HRSTR;       /*!< 0x094 APB1H peripheral reset                */
    __IO uint32_t APB2RSTR;        /*!< 0x098 APB2 peripheral reset                 */
    __IO uint32_t APB4RSTR;        /*!< 0x09C APB4 peripheral reset                 */
    __IO uint32_t GCR;             /*!< 0x0A0 Global control register               */
         uint32_t RESERVED6;       /*!< 0x0A4                                        */
    __IO uint32_t D3AMR;           /*!< 0x0A8 D3 autonomous mode register           */
         uint32_t RESERVED7[9];    /*!< 0x0AC-0x0CC                                 */
    __IO uint32_t RSR;             /*!< 0x0D0 Reset status register                 */
    __IO uint32_t AHB3ENR;         /*!< 0x0D4 AHB3 clock enable                     */
    __IO uint32_t AHB1ENR;         /*!< 0x0D8 AHB1 clock enable                     */
    __IO uint32_t AHB2ENR;         /*!< 0x0DC AHB2 clock enable                     */
    __IO uint32_t AHB4ENR;         /*!< 0x0E0 AHB4 clock enable (GPIO, CRC, BDMA …) */
    __IO uint32_t APB3ENR;         /*!< 0x0E4 APB3 clock enable                     */
    __IO uint32_t APB1LENR;        /*!< 0x0E8 APB1L clock enable (TIM2..7, SPI2/3, USART2/3, UART4..8 …) */
    __IO uint32_t APB1HENR;        /*!< 0x0EC APB1H clock enable                    */
    __IO uint32_t APB2ENR;         /*!< 0x0F0 APB2 clock enable (TIM1/8, USART1/6, SPI1/4/5 …)         */
    __IO uint32_t APB4ENR;         /*!< 0x0F4 APB4 clock enable (SYSCFG, I2C4, LPUART1 …)              */
} RCC_TypeDef;

/* PWR — fields used by SystemInit (VOS scaling) */
typedef struct
{
    __IO uint32_t CR1;    /*!< 0x00 Power control register 1   */
    __IO uint32_t CSR1;   /*!< 0x04 Power control/status 1     */
    __IO uint32_t CR2;    /*!< 0x08 Power control register 2   */
    __IO uint32_t CR3;    /*!< 0x0C Power control register 3   */
    __IO uint32_t CPUCR;  /*!< 0x10 CPU control register       */
         uint32_t RSRVD;  /*!< 0x14 Reserved                   */
    __IO uint32_t D3CR;   /*!< 0x18 D3 domain control register */
         uint32_t RSRVD2; /*!< 0x1C Reserved                   */
    __IO uint32_t WKUPCR; /*!< 0x20 Wakeup clear register      */
    __IO uint32_t WKUPFR; /*!< 0x24 Wakeup flag register       */
    __IO uint32_t WKUPEPR;/*!< 0x28 Wakeup enable/polarity     */
} PWR_TypeDef;

