SS-Electronics/FreeRTOS-OS/arch/devices/STM/STM32H7xx/STM32H723/stm32_h723xx.h
/* FLASH interface (used by HAL_FLASH for programming and latency) */
typedef struct
{
    __IO uint32_t ACR;          /*!< 0x000 Flash access control (latency, caches) */
         uint32_t RESERVED0;    /*!< 0x004                                         */
    __IO uint32_t OPTKEYR;      /*!< 0x008 Option byte key                        */
    __IO uint32_t CR;           /*!< 0x00C Control register                       */
    __IO uint32_t SR;           /*!< 0x010 Status register                        */
    __IO uint32_t CCR;          /*!< 0x014 Clear control register                 */
    __IO uint32_t OPTCR;        /*!< 0x018 Option control register                */
    __IO uint32_t OPTSR_CUR;    /*!< 0x01C Option status current                  */
    __IO uint32_t OPTSR_PRG;    /*!< 0x020 Option status programmed               */
    __IO uint32_t OPTCCR;       /*!< 0x024 Option clear control register          */
} FLASH_TypeDef;

/* SYSCFG — used by HAL for EXTI configuration */
typedef struct
{
    __IO uint32_t PMCR;         /*!< 0x04 Peripheral mode configuration  */
    __IO uint32_t EXTICR[4];    /*!< 0x08 External interrupt config regs */
    __IO uint32_t CFGR;         /*!< 0x18 Configuration register         */
         uint32_t RESERVED0;    /*!< 0x1C                                 */
    __IO uint32_t CCCSR;        /*!< 0x20 Compensation cell ctrl/status  */
    __IO uint32_t CCVR;         /*!< 0x24 Compensation cell value        */
    __IO uint32_t CCCR;         /*!< 0x28 Compensation cell code         */
    __IO uint32_t PWRCR;        /*!< 0x2C Power control                  */
         uint32_t RESERVED1[61];
    __IO uint32_t PKGR;         /*!< 0x124 Package register              */
         uint32_t RESERVED2[118];
    __IO uint32_t UR0;          /*!< 0x300 User register 0               */
} SYSCFG_TypeDef;

/* EXTI — used by HAL GPIO for external interrupt configuration */
typedef struct
{
    __IO uint32_t RTSR1;        /*!< 0x00 Rising trigger select 1   */
    __IO uint32_t FTSR1;        /*!< 0x04 Falling trigger select 1  */
    __IO uint32_t SWIER1;       /*!< 0x08 Software interrupt event 1 */
    __IO uint32_t D3PMR1;       /*!< 0x0C D3 pend mask 1            */
    __IO uint32_t D3PCR1L;      /*!< 0x10 D3 pend clear reg 1L      */
    __IO uint32_t D3PCR1H;      /*!< 0x14 D3 pend clear reg 1H      */
         uint32_t RESERVED0[2]; /*!< 0x18-0x1C                       */
    __IO uint32_t RTSR2;        /*!< 0x20 Rising trigger select 2   */
    __IO uint32_t FTSR2;        /*!< 0x24 Falling trigger select 2  */
    __IO uint32_t SWIER2;       /*!< 0x28 Software interrupt event 2 */
    __IO uint32_t D3PMR2;       /*!< 0x2C D3 pend mask 2            */
    __IO uint32_t D3PCR2L;      /*!< 0x30 D3 pend clear reg 2L      */
    __IO uint32_t D3PCR2H;      /*!< 0x34 D3 pend clear reg 2H      */
         uint32_t RESERVED1[2]; /*!< 0x38-0x3C                       */
    __IO uint32_t RTSR3;        /*!< 0x40 Rising trigger select 3   */
    __IO uint32_t FTSR3;        /*!< 0x44 Falling trigger select 3  */
    __IO uint32_t SWIER3;       /*!< 0x48 Software interrupt event 3 */
    __IO uint32_t D3PMR3;       /*!< 0x4C D3 pend mask 3            */
    __IO uint32_t D3PCR3L;      /*!< 0x50 D3 pend clear reg 3L      */
    __IO uint32_t D3PCR3H;      /*!< 0x54 D3 pend clear reg 3H      */
         uint32_t RESERVED2[10]; /* 0x58-0x7C                        */
    __IO uint32_t IMR1;         /*!< 0x80 CPU1 interrupt mask 1      */
    __IO uint32_t EMR1;         /*!< 0x84 CPU1 event mask 1          */
    __IO uint32_t PR1;          /*!< 0x88 CPU1 pending register 1    */
         uint32_t RESERVED3;
    __IO uint32_t IMR2;         /*!< 0x90 CPU1 interrupt mask 2      */
    __IO uint32_t EMR2;         /*!< 0x94 CPU1 event mask 2          */
    __IO uint32_t PR2;          /*!< 0x98 CPU1 pending register 2    */
         uint32_t RESERVED4;
    __IO uint32_t IMR3;         /*!< 0xA0 CPU1 interrupt mask 3      */
    __IO uint32_t EMR3;         /*!< 0xA4 CPU1 event mask 3          */
    __IO uint32_t PR3;          /*!< 0xA8 CPU1 pending register 3    */
} EXTI_TypeDef;

/* TIM — only the CR1/CR2/ARR/PSC fields used by HAL_TIM timebase */
typedef struct
{
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __IO uint32_t SMCR;
    __IO uint32_t DIER;
    __IO uint32_t SR;
    __IO uint32_t EGR;
    __IO uint32_t CCMR1;
    __IO uint32_t CCMR2;
    __IO uint32_t CCER;
    __IO uint32_t CNT;
    __IO uint32_t PSC;
    __IO uint32_t ARR;
    __IO uint32_t RCR;
    __IO uint32_t CCR1;
    __IO uint32_t CCR2;
    __IO uint32_t CCR3;
    __IO uint32_t CCR4;
    __IO uint32_t BDTR;
    __IO uint32_t DCR;
    __IO uint32_t DMAR;
} TIM_TypeDef;

/* IWDG */
typedef struct
{
    __IO uint32_t KR;
    __IO uint32_t PR;
    __IO uint32_t RLR;
    __IO uint32_t SR;
    __IO uint32_t WINR;
} IWDG_TypeDef;

/* ── 4. Peripheral Base Addresses (RM0468 §3 Memory Map) ────────────────── */

/* AHB4 — GPIO and RCC are on the D3 power domain AHB4 bus at 0x58000000    */
#define D3_AHB4PERIPH_BASE    0x58020000UL
#define GPIOA_BASE            (D3_AHB4PERIPH_BASE + 0x0000UL)  /*!< 0x58020000 */
#define GPIOB_BASE            (D3_AHB4PERIPH_BASE + 0x0400UL)  /*!< 0x58020400 */
#define GPIOC_BASE            (D3_AHB4PERIPH_BASE + 0x0800UL)  /*!< 0x58020800 */
#define GPIOD_BASE            (D3_AHB4PERIPH_BASE + 0x0C00UL)  /*!< 0x58020C00 */
#define GPIOE_BASE            (D3_AHB4PERIPH_BASE + 0x1000UL)  /*!< 0x58021000 */
#define GPIOF_BASE            (D3_AHB4PERIPH_BASE + 0x1400UL)  /*!< 0x58021400 */
#define GPIOG_BASE            (D3_AHB4PERIPH_BASE + 0x1800UL)  /*!< 0x58021800 */
#define GPIOH_BASE            (D3_AHB4PERIPH_BASE + 0x1C00UL)  /*!< 0x58021C00 */

#define RCC_BASE              0x58024400UL
#define PWR_BASE              0x58024800UL

/* APB4 */
#define EXTI_BASE             0x58000000UL
#define SYSCFG_BASE           0x58000400UL

/* Flash interface (AHB3 / D1 domain — differs from F4 location) */
#define FLASH_R_BASE          0x52002000UL

/* APB1L — USART2, USART3, UART4, UART5, UART7, UART8, I2C1..3, SPI2/3 */
#define APB1PERIPH_BASE       0x40000000UL
#define USART2_BASE           (APB1PERIPH_BASE + 0x4400UL)  /*!< 0x40004400 */
#define USART3_BASE           (APB1PERIPH_BASE + 0x4800UL)  /*!< 0x40004800 */
#define UART4_BASE            (APB1PERIPH_BASE + 0x4C00UL)  /*!< 0x40004C00 */
#define UART5_BASE            (APB1PERIPH_BASE + 0x5000UL)  /*!< 0x40005000 */
#define I2C1_BASE             (APB1PERIPH_BASE + 0x5400UL)  /*!< 0x40005400 */
#define I2C2_BASE             (APB1PERIPH_BASE + 0x5800UL)  /*!< 0x40005800 */
#define I2C3_BASE             (APB1PERIPH_BASE + 0x5C00UL)  /*!< 0x40005C00 */
#define UART7_BASE            (APB1PERIPH_BASE + 0x7800UL)  /*!< 0x40007800 */
#define UART8_BASE            (APB1PERIPH_BASE + 0x7C00UL)  /*!< 0x40007C00 */
#define SPI2_BASE             (APB1PERIPH_BASE + 0x3800UL)  /*!< 0x40003800 */
#define SPI3_BASE             (APB1PERIPH_BASE + 0x3C00UL)  /*!< 0x40003C00 */
#define TIM2_BASE             (APB1PERIPH_BASE + 0x0000UL)  /*!< 0x40000000 */
#define TIM3_BASE             (APB1PERIPH_BASE + 0x0400UL)  /*!< 0x40000400 */
#define TIM4_BASE             (APB1PERIPH_BASE + 0x0800UL)  /*!< 0x40000800 */
#define TIM5_BASE             (APB1PERIPH_BASE + 0x0C00UL)  /*!< 0x40000C00 */
#define TIM6_BASE             (APB1PERIPH_BASE + 0x1000UL)  /*!< 0x40001000 */
#define TIM7_BASE             (APB1PERIPH_BASE + 0x1400UL)  /*!< 0x40001400 */

/* APB2 — USART1, USART6, SPI1/4/5, TIM1/8 */
#define APB2PERIPH_BASE       0x40010000UL
#define TIM1_BASE             (APB2PERIPH_BASE + 0x0000UL)  /*!< 0x40010000 */
#define TIM8_BASE             (APB2PERIPH_BASE + 0x0400UL)  /*!< 0x40010400 */
#define USART1_BASE           (APB2PERIPH_BASE + 0x1000UL)  /*!< 0x40011000 */
#define USART6_BASE           (APB2PERIPH_BASE + 0x1400UL)  /*!< 0x40011400 */
#define SPI1_BASE             (APB2PERIPH_BASE + 0x3000UL)  /*!< 0x40013000 */
#define SPI4_BASE             (APB2PERIPH_BASE + 0x3400UL)  /*!< 0x40013400 */
#define TIM15_BASE            (APB2PERIPH_BASE + 0x4000UL)  /*!< 0x40014000 */
#define TIM16_BASE            (APB2PERIPH_BASE + 0x4400UL)  /*!< 0x40014400 */
#define TIM17_BASE            (APB2PERIPH_BASE + 0x4800UL)  /*!< 0x40014800 */
#define SPI5_BASE             (APB2PERIPH_BASE + 0x5000UL)  /*!< 0x40015000 */

/* APB4 — I2C4 */
#define APB4PERIPH_BASE       0x58000000UL
#define I2C4_BASE             (APB4PERIPH_BASE + 0x1C00UL)  /*!< 0x58001C00 */
#define SPI6_BASE             (APB4PERIPH_BASE + 0x1400UL)  /*!< 0x58001400 */

/* IWDG1 */
#define IWDG1_BASE            0x58004800UL

/* ── 5. Peripheral Instance Pointers ─────────────────────────────────────── */
#define GPIOA    ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB    ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC    ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD    ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE    ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOF    ((GPIO_TypeDef *) GPIOF_BASE)
#define GPIOG    ((GPIO_TypeDef *) GPIOG_BASE)
#define GPIOH    ((GPIO_TypeDef *) GPIOH_BASE)

#define USART1   ((USART_TypeDef *) USART1_BASE)
#define USART2   ((USART_TypeDef *) USART2_BASE)
#define USART3   ((USART_TypeDef *) USART3_BASE)
#define UART4    ((USART_TypeDef *) UART4_BASE)
#define UART5    ((USART_TypeDef *) UART5_BASE)
#define USART6   ((USART_TypeDef *) USART6_BASE)
#define UART7    ((USART_TypeDef *) UART7_BASE)
#define UART8    ((USART_TypeDef *) UART8_BASE)

#define I2C1     ((I2C_TypeDef *) I2C1_BASE)
#define I2C2     ((I2C_TypeDef *) I2C2_BASE)
#define I2C3     ((I2C_TypeDef *) I2C3_BASE)
#define I2C4     ((I2C_TypeDef *) I2C4_BASE)

#define SPI1     ((SPI_TypeDef *) SPI1_BASE)
#define SPI2     ((SPI_TypeDef *) SPI2_BASE)
#define SPI3     ((SPI_TypeDef *) SPI3_BASE)
#define SPI4     ((SPI_TypeDef *) SPI4_BASE)
#define SPI5     ((SPI_TypeDef *) SPI5_BASE)
#define SPI6     ((SPI_TypeDef *) SPI6_BASE)

