SS-Electronics/FreeRTOS-OS/arch/devices/STM/STM32H7xx/STM32H723/stm32_h723xx.h
#define TIM1     ((TIM_TypeDef *) TIM1_BASE)
#define TIM2     ((TIM_TypeDef *) TIM2_BASE)
#define TIM3     ((TIM_TypeDef *) TIM3_BASE)
#define TIM4     ((TIM_TypeDef *) TIM4_BASE)
#define TIM5     ((TIM_TypeDef *) TIM5_BASE)
#define TIM6     ((TIM_TypeDef *) TIM6_BASE)
#define TIM7     ((TIM_TypeDef *) TIM7_BASE)
#define TIM8     ((TIM_TypeDef *) TIM8_BASE)
#define TIM15    ((TIM_TypeDef *) TIM15_BASE)
#define TIM16    ((TIM_TypeDef *) TIM16_BASE)
#define TIM17    ((TIM_TypeDef *) TIM17_BASE)

#define RCC      ((RCC_TypeDef *) RCC_BASE)
#define PWR      ((PWR_TypeDef *) PWR_BASE)
#define FLASH    ((FLASH_TypeDef *) FLASH_R_BASE)
#define SYSCFG   ((SYSCFG_TypeDef *) SYSCFG_BASE)
#define EXTI     ((EXTI_TypeDef *) EXTI_BASE)
#define IWDG1    ((IWDG_TypeDef *) IWDG1_BASE)
#define IWDG     IWDG1   /* alias — HAL uses IWDG */

/* ── 6. RCC Bit-field Masks used by __HAL_RCC_xxx_CLK_ENABLE() ──────────── */
/* AHB4ENR — GPIO clock enables (RM0468 §8.7.44) */
#define RCC_AHB4ENR_GPIOAEN_Pos   (0U)
#define RCC_AHB4ENR_GPIOAEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOAEN_Pos)
#define RCC_AHB4ENR_GPIOA         RCC_AHB4ENR_GPIOAEN_Msk
#define RCC_AHB4ENR_GPIOBEN_Pos   (1U)
#define RCC_AHB4ENR_GPIOBEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOBEN_Pos)
#define RCC_AHB4ENR_GPIOB         RCC_AHB4ENR_GPIOBEN_Msk
#define RCC_AHB4ENR_GPIOCEN_Pos   (2U)
#define RCC_AHB4ENR_GPIOCEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOCEN_Pos)
#define RCC_AHB4ENR_GPIOC         RCC_AHB4ENR_GPIOCEN_Msk
#define RCC_AHB4ENR_GPIODEN_Pos   (3U)
#define RCC_AHB4ENR_GPIODEN_Msk   (0x1UL << RCC_AHB4ENR_GPIODEN_Pos)
#define RCC_AHB4ENR_GPIOD         RCC_AHB4ENR_GPIODEN_Msk
#define RCC_AHB4ENR_GPIOEEN_Pos   (4U)
#define RCC_AHB4ENR_GPIOEEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOEEN_Pos)
#define RCC_AHB4ENR_GPIOE         RCC_AHB4ENR_GPIOEEN_Msk
#define RCC_AHB4ENR_GPIOFEN_Pos   (5U)
#define RCC_AHB4ENR_GPIOFEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOFEN_Pos)
#define RCC_AHB4ENR_GPIOF         RCC_AHB4ENR_GPIOFEN_Msk
#define RCC_AHB4ENR_GPIOGEN_Pos   (6U)
#define RCC_AHB4ENR_GPIOGEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOGEN_Pos)
#define RCC_AHB4ENR_GPIOG         RCC_AHB4ENR_GPIOGEN_Msk
#define RCC_AHB4ENR_GPIOHEN_Pos   (7U)
#define RCC_AHB4ENR_GPIOHEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOHEN_Pos)
#define RCC_AHB4ENR_GPIOH         RCC_AHB4ENR_GPIOHEN_Msk

/* APB1LENR — USART2/3, UART4/5/7/8, I2C1..3, SPI2/3 clock enables */
#define RCC_APB1LENR_USART2EN_Pos (17U)
#define RCC_APB1LENR_USART2EN_Msk (0x1UL << RCC_APB1LENR_USART2EN_Pos)
#define RCC_APB1LENR_USART3EN_Pos (18U)
#define RCC_APB1LENR_USART3EN_Msk (0x1UL << RCC_APB1LENR_USART3EN_Pos)
#define RCC_APB1LENR_UART4EN_Pos  (19U)
#define RCC_APB1LENR_UART4EN_Msk  (0x1UL << RCC_APB1LENR_UART4EN_Pos)
#define RCC_APB1LENR_UART5EN_Pos  (20U)
#define RCC_APB1LENR_UART5EN_Msk  (0x1UL << RCC_APB1LENR_UART5EN_Pos)
#define RCC_APB1LENR_I2C1EN_Pos   (21U)
#define RCC_APB1LENR_I2C1EN_Msk   (0x1UL << RCC_APB1LENR_I2C1EN_Pos)
#define RCC_APB1LENR_I2C2EN_Pos   (22U)
#define RCC_APB1LENR_I2C2EN_Msk   (0x1UL << RCC_APB1LENR_I2C2EN_Pos)
#define RCC_APB1LENR_I2C3EN_Pos   (23U)
#define RCC_APB1LENR_I2C3EN_Msk   (0x1UL << RCC_APB1LENR_I2C3EN_Pos)
#define RCC_APB1LENR_UART7EN_Pos  (30U)
#define RCC_APB1LENR_UART7EN_Msk  (0x1UL << RCC_APB1LENR_UART7EN_Pos)
#define RCC_APB1LENR_UART8EN_Pos  (31U)
#define RCC_APB1LENR_UART8EN_Msk  (0x1UL << RCC_APB1LENR_UART8EN_Pos)
#define RCC_APB1LENR_SPI2EN_Pos   (14U)
#define RCC_APB1LENR_SPI2EN_Msk   (0x1UL << RCC_APB1LENR_SPI2EN_Pos)
#define RCC_APB1LENR_SPI3EN_Pos   (15U)
#define RCC_APB1LENR_SPI3EN_Msk   (0x1UL << RCC_APB1LENR_SPI3EN_Pos)

/* APB2ENR — USART1/6, SPI1/4/5, TIM1/8 clock enables */
#define RCC_APB2ENR_TIM1EN_Pos    (0U)
#define RCC_APB2ENR_TIM1EN_Msk    (0x1UL << RCC_APB2ENR_TIM1EN_Pos)
#define RCC_APB2ENR_TIM8EN_Pos    (1U)
#define RCC_APB2ENR_TIM8EN_Msk    (0x1UL << RCC_APB2ENR_TIM8EN_Pos)
#define RCC_APB2ENR_USART1EN_Pos  (4U)
#define RCC_APB2ENR_USART1EN_Msk  (0x1UL << RCC_APB2ENR_USART1EN_Pos)
#define RCC_APB2ENR_USART6EN_Pos  (5U)
#define RCC_APB2ENR_USART6EN_Msk  (0x1UL << RCC_APB2ENR_USART6EN_Pos)
#define RCC_APB2ENR_SPI1EN_Pos    (12U)
#define RCC_APB2ENR_SPI1EN_Msk    (0x1UL << RCC_APB2ENR_SPI1EN_Pos)
#define RCC_APB2ENR_SPI4EN_Pos    (13U)
#define RCC_APB2ENR_SPI4EN_Msk    (0x1UL << RCC_APB2ENR_SPI4EN_Pos)
#define RCC_APB2ENR_SPI5EN_Pos    (20U)
#define RCC_APB2ENR_SPI5EN_Msk    (0x1UL << RCC_APB2ENR_SPI5EN_Pos)

/* APB4ENR — SYSCFG, I2C4, SPI6 */
#define RCC_APB4ENR_SYSCFGEN_Pos  (1U)
#define RCC_APB4ENR_SYSCFGEN_Msk  (0x1UL << RCC_APB4ENR_SYSCFGEN_Pos)
#define RCC_APB4ENR_I2C4EN_Pos    (7U)
#define RCC_APB4ENR_I2C4EN_Msk    (0x1UL << RCC_APB4ENR_I2C4EN_Pos)
#define RCC_APB4ENR_SPI6EN_Pos    (5U)
#define RCC_APB4ENR_SPI6EN_Msk    (0x1UL << RCC_APB4ENR_SPI6EN_Pos)

/* ── 7. HAL RCC Clock-enable Macros ─────────────────────────────────────── */
/* These replicate the STM32H7xx HAL RCC macros for use when building without
 * the full CubeH7 HAL pack.  They are gated on USE_HAL_DRIVER so the real
 * HAL macros take precedence if present.                                     */
#ifndef __HAL_RCC_GPIOA_CLK_ENABLE
#  define __HAL_RCC_GPIOA_CLK_ENABLE()   (RCC->AHB4ENR |= RCC_AHB4ENR_GPIOAEN_Msk)
#  define __HAL_RCC_GPIOB_CLK_ENABLE()   (RCC->AHB4ENR |= RCC_AHB4ENR_GPIOBEN_Msk)
#  define __HAL_RCC_GPIOC_CLK_ENABLE()   (RCC->AHB4ENR |= RCC_AHB4ENR_GPIOCEN_Msk)
#  define __HAL_RCC_GPIOD_CLK_ENABLE()   (RCC->AHB4ENR |= RCC_AHB4ENR_GPIODEN_Msk)
#  define __HAL_RCC_GPIOE_CLK_ENABLE()   (RCC->AHB4ENR |= RCC_AHB4ENR_GPIOEEN_Msk)
#  define __HAL_RCC_GPIOF_CLK_ENABLE()   (RCC->AHB4ENR |= RCC_AHB4ENR_GPIOFEN_Msk)
#  define __HAL_RCC_GPIOG_CLK_ENABLE()   (RCC->AHB4ENR |= RCC_AHB4ENR_GPIOGEN_Msk)
#  define __HAL_RCC_GPIOH_CLK_ENABLE()   (RCC->AHB4ENR |= RCC_AHB4ENR_GPIOHEN_Msk)
#  define __HAL_RCC_USART1_CLK_ENABLE()  (RCC->APB2ENR  |= RCC_APB2ENR_USART1EN_Msk)
#  define __HAL_RCC_USART2_CLK_ENABLE()  (RCC->APB1LENR |= RCC_APB1LENR_USART2EN_Msk)
#  define __HAL_RCC_USART3_CLK_ENABLE()  (RCC->APB1LENR |= RCC_APB1LENR_USART3EN_Msk)
#  define __HAL_RCC_UART4_CLK_ENABLE()   (RCC->APB1LENR |= RCC_APB1LENR_UART4EN_Msk)
#  define __HAL_RCC_UART5_CLK_ENABLE()   (RCC->APB1LENR |= RCC_APB1LENR_UART5EN_Msk)
#  define __HAL_RCC_USART6_CLK_ENABLE()  (RCC->APB2ENR  |= RCC_APB2ENR_USART6EN_Msk)
#  define __HAL_RCC_UART7_CLK_ENABLE()   (RCC->APB1LENR |= RCC_APB1LENR_UART7EN_Msk)
#  define __HAL_RCC_UART8_CLK_ENABLE()   (RCC->APB1LENR |= RCC_APB1LENR_UART8EN_Msk)
#  define __HAL_RCC_I2C1_CLK_ENABLE()    (RCC->APB1LENR |= RCC_APB1LENR_I2C1EN_Msk)
#  define __HAL_RCC_I2C2_CLK_ENABLE()    (RCC->APB1LENR |= RCC_APB1LENR_I2C2EN_Msk)
#  define __HAL_RCC_I2C3_CLK_ENABLE()    (RCC->APB1LENR |= RCC_APB1LENR_I2C3EN_Msk)
#  define __HAL_RCC_I2C4_CLK_ENABLE()    (RCC->APB4ENR  |= RCC_APB4ENR_I2C4EN_Msk)
#  define __HAL_RCC_SPI1_CLK_ENABLE()    (RCC->APB2ENR  |= RCC_APB2ENR_SPI1EN_Msk)
#  define __HAL_RCC_SPI2_CLK_ENABLE()    (RCC->APB1LENR |= RCC_APB1LENR_SPI2EN_Msk)
#  define __HAL_RCC_SPI3_CLK_ENABLE()    (RCC->APB1LENR |= RCC_APB1LENR_SPI3EN_Msk)
#  define __HAL_RCC_SPI4_CLK_ENABLE()    (RCC->APB2ENR  |= RCC_APB2ENR_SPI4EN_Msk)
#  define __HAL_RCC_SPI5_CLK_ENABLE()    (RCC->APB2ENR  |= RCC_APB2ENR_SPI5EN_Msk)
#  define __HAL_RCC_SPI6_CLK_ENABLE()    (RCC->APB4ENR  |= RCC_APB4ENR_SPI6EN_Msk)
#  define __HAL_RCC_SYSCFG_CLK_ENABLE()  (RCC->APB4ENR  |= RCC_APB4ENR_SYSCFGEN_Msk)
#  define __HAL_RCC_PWR_CLK_ENABLE()     do { } while(0)   /* PWR always on in H7 */
#endif

/* ── 8. Flash Latency (FLASH_ACR) ──────────────────────────────────────── */
/* H7 at VOS1 (1.15V, up to 550 MHz): latency = 4 WS (AXI bus @275 MHz)    */
#define FLASH_LATENCY_0    (0x00000000UL)
#define FLASH_LATENCY_1    (0x00000001UL)
#define FLASH_LATENCY_2    (0x00000002UL)
#define FLASH_LATENCY_3    (0x00000003UL)
#define FLASH_LATENCY_4    (0x00000004UL)
#define FLASH_LATENCY_5    (0x00000005UL)
#define FLASH_LATENCY_6    (0x00000006UL)
#define FLASH_LATENCY_7    (0x00000007UL)

/* ── 9. RCC PLL / clock-mux bit-fields ─────────────────────────────────── */
/* Only the values needed by SystemInit. Full definitions live in the HAL.   */
#define RCC_PLLCKSELR_PLLSRC_Pos  (0U)
#define RCC_PLLCKSELR_PLLSRC_HSE (0x02UL << RCC_PLLCKSELR_PLLSRC_Pos)
#define RCC_PLLCKSELR_PLLSRC_HSI (0x00UL)
#define RCC_PLLCKSELR_DIVM1_Pos   (4U)

#define RCC_PLLCFGR_PLL1VCOSEL_Pos  (2U)    /* 0 = wide (192-836 MHz), 1 = medium */
#define RCC_PLLCFGR_PLL1RGE_Pos     (2U)    /* input freq range */
#define RCC_PLLCFGR_PLL1FRACEN_Pos  (0U)

#define RCC_CR_HSEON_Pos   (16U)
#define RCC_CR_HSEON_Msk   (0x1UL << RCC_CR_HSEON_Pos)
#define RCC_CR_HSERDY_Pos  (17U)
#define RCC_CR_HSERDY_Msk  (0x1UL << RCC_CR_HSERDY_Pos)
#define RCC_CR_PLL1ON_Pos  (24U)
#define RCC_CR_PLL1ON_Msk  (0x1UL << RCC_CR_PLL1ON_Pos)
#define RCC_CR_PLL1RDY_Pos (25U)
#define RCC_CR_PLL1RDY_Msk (0x1UL << RCC_CR_PLL1RDY_Pos)

#define RCC_CFGR_SW_Pos    (0U)
#define RCC_CFGR_SW_PLL1   (0x03UL << RCC_CFGR_SW_Pos)
#define RCC_CFGR_SWS_Pos   (3U)
#define RCC_CFGR_SWS_PLL1  (0x03UL << RCC_CFGR_SWS_Pos)

/* ── 10. PWR bit-fields used by VOS scaling ─────────────────────────────── */
#define PWR_D3CR_VOS_Pos        (14U)
#define PWR_D3CR_VOS_Msk        (0x3UL << PWR_D3CR_VOS_Pos)
#define PWR_D3CR_VOS_SCALE_1    (0x3UL << PWR_D3CR_VOS_Pos)   /*!< VOS1 — highest perf */
#define PWR_D3CR_VOSRDY_Pos     (13U)
#define PWR_D3CR_VOSRDY_Msk     (0x1UL << PWR_D3CR_VOSRDY_Pos)

/* ── 11. FLASH ACR bit-fields ──────────────────────────────────────────── */
#define FLASH_ACR_LATENCY_Pos   (0U)
#define FLASH_ACR_LATENCY_Msk   (0xFUL << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_WRHIGHFREQ_Pos (4U)
#define FLASH_ACR_WRHIGHFREQ_Msk (0x3UL << FLASH_ACR_WRHIGHFREQ_Pos)

/* ── 12. GPIO AF constants (RM0468 Table 10-12) ─────────────────────────── */
/* Alternate function numbers — used by gen_board_config.py as GPIO_AF<n>_<inst> */
#define GPIO_AF7_USART1    (7U)
#define GPIO_AF7_USART2    (7U)
#define GPIO_AF7_USART3    (7U)
#define GPIO_AF8_UART4     (8U)
#define GPIO_AF8_UART5     (8U)
#define GPIO_AF7_USART6    (7U)
#define GPIO_AF7_UART7     (7U)
#define GPIO_AF8_UART8     (8U)
#define GPIO_AF4_I2C1      (4U)
#define GPIO_AF4_I2C2      (4U)
#define GPIO_AF4_I2C3      (4U)
#define GPIO_AF6_I2C4      (6U)
#define GPIO_AF5_SPI1      (5U)
#define GPIO_AF5_SPI2      (5U)
#define GPIO_AF6_SPI3      (6U)
#define GPIO_AF5_SPI4      (5U)
#define GPIO_AF5_SPI5      (5U)
#define GPIO_AF8_SPI6      (8U)

/* GPIO mode/speed/pull constants — same HAL API names as F4 */
#define GPIO_MODE_INPUT               (0x00000000UL)
#define GPIO_MODE_OUTPUT_PP           (0x00000001UL)
#define GPIO_MODE_OUTPUT_OD           (0x00000011UL)
#define GPIO_MODE_AF_PP               (0x00000002UL)
#define GPIO_MODE_AF_OD               (0x00000012UL)
#define GPIO_MODE_ANALOG              (0x00000003UL)
#define GPIO_MODE_IT_RISING           (0x10110000UL)
#define GPIO_MODE_IT_FALLING          (0x10210000UL)
#define GPIO_MODE_IT_RISING_FALLING   (0x10310000UL)

#define GPIO_NOPULL         (0x00000000UL)
#define GPIO_PULLUP         (0x00000001UL)
#define GPIO_PULLDOWN       (0x00000002UL)

#define GPIO_SPEED_FREQ_LOW       (0x00000000UL)
#define GPIO_SPEED_FREQ_MEDIUM    (0x00000001UL)
#define GPIO_SPEED_FREQ_HIGH      (0x00000002UL)
#define GPIO_SPEED_FREQ_VERY_HIGH (0x00000003UL)

#define GPIO_PIN_0   (0x0001U)
#define GPIO_PIN_1   (0x0002U)
#define GPIO_PIN_2   (0x0004U)
#define GPIO_PIN_3   (0x0008U)
#define GPIO_PIN_4   (0x0010U)
#define GPIO_PIN_5   (0x0020U)
#define GPIO_PIN_6   (0x0040U)
#define GPIO_PIN_7   (0x0080U)
#define GPIO_PIN_8   (0x0100U)
#define GPIO_PIN_9   (0x0200U)
#define GPIO_PIN_10  (0x0400U)
#define GPIO_PIN_11  (0x0800U)
#define GPIO_PIN_12  (0x1000U)
#define GPIO_PIN_13  (0x2000U)
#define GPIO_PIN_14  (0x4000U)
#define GPIO_PIN_15  (0x8000U)

#define GPIO_PIN_SET    1U
#define GPIO_PIN_RESET  0U

#ifdef __cplusplus
}
#endif

#endif /* __STM32_H723XX_H */
